# Dataframe

A DataFrame is like a table where the data is organized in rows and columns. It is a two-dimensional data structure like a two-dimensional array¶

     Country      Capital      Population
0    Canada       Ottawa       37742154
1    Australia    Canberra     25499884
2    UK           London       67886011
3    Brazil       Brasília     212559417

Here,
•	Country, Capital and Population are the column names.
•	Each row represents a record, with the index value on the left. The index values are auto-assigned starting from 0.
•	Each column contains data of the same type. For instance, Country and Capital contain strings, and Population contains integers.

# Creation of Dataframe

# Pandas DataFrame Using Python List

In [1]:
import pandas as pd

data = [['John', 25, 'New York'],
       ['Alice', 30, 'London'],
       ['Bob', 35, 'Paris']]

df = pd.DataFrame(data, columns=['Name', 'Age', 'City'])

print(df)

    Name  Age      City
0   John   25  New York
1  Alice   30    London
2    Bob   35     Paris

# Pandas DataFrame Using Python Dictionary

In [2]:
import pandas as pd

data = {'Name': ['John', 'Alice', 'Bob'],
       'Age': [25, 30, 35],
       'City': ['New York', 'London', 'Paris']}

df = pd.DataFrame(data)

print(df)

    Name  Age      City
0   John   25  New York
1  Alice   30    London
2    Bob   35     Paris

# Pandas DataFrame From a File

In [3]:
import pandas as pd

# load data from a CSV file                            # here file is saved on same folder where notebook is opened
df = pd.read_csv('data.csv')

print(df)

   Unnamed: 0   Name  Age      City
0           0   John   25  New York
1           1  Alice   30    London
2           2    Bob   35     Paris

In this example, we used the read_csv() function which reads the CSV file data.csv, and automatically creates a DataFrame object df, containing data from the CSV file.

Note: We can also create a DataFrame using other file types like JSON, Excel spreadsheet, SQL database, etc. The methods to read different file types are listed below:

JSON - read_json()
Excel spreadsheet - read_excel()
SQL - read_sql()

In [4]:
import pandas as pd

# load data from a CSV file                            # here path is from root directory 
df1 = pd.read_csv(r'C:\Users\NAINSI\Downloads\population_dataset\world_country_stats.csv')

print(df1)

             country   region  land_area  fertility_rate  median_age
0        Afghanistan     Asia     652860             4.4        17.0
1            Albania   Europe      27400             1.4        38.0
2            Algeria   Africa    2381740             2.8        28.0
3     American Samoa  Oceania        200             2.2        29.0
4            Andorra   Europe        470             1.1        43.0
..               ...      ...        ...             ...         ...
229  Wallis & Futuna  Oceania        140             1.9        37.0
230   Western Sahara   Africa     266000             2.2        32.0
231            Yemen     Asia     527970             3.6        19.0
232           Zambia   Africa     743390             4.2        17.0
233         Zimbabwe   Africa     386850             3.4        18.0

[234 rows x 5 columns]

# Create an Empty DataFrame

In [5]:
import pandas as pd

# create an empty DataFrame
df = pd.DataFrame()

print(df)

Empty DataFrame
Columns: []
Index: []

# Conversion of dataframe to csv format

In [6]:
import pandas as pd 
data = [['John', 25, 'New York'],
       ['Alice', 30, 'London'],
       ['Bob', 35, 'Paris']]

df = pd.DataFrame(data, columns=['Name', 'Age', 'City'])

df.to_csv('data.csv')                                        #Here data is filename with csv format

In [7]:
data=pd.read_csv('data.csv')                            # reading csv file 
data

   Unnamed: 0   Name  Age      City
0           0   John   25  New York
1           1  Alice   30    London
2           2    Bob   35     Paris

In [8]:
import pandas as pd 
data = [['John', 25, 'New York'],
       ['Alice', 30, 'London'],
       ['Bob', 35, 'Paris']]

df = pd.DataFrame(data, columns=['Name', 'Age', 'City'])

df.to_csv('data1.csv',index=False) 

# here index=False helps to remove index column creation in csv file

In [9]:
pd.read_csv('data1.csv')

    Name  Age      City
0   John   25  New York
1  Alice   30    London
2    Bob   35     Paris

# use of info ,describe , head & tail

In [10]:
df.head(2)  # gives starting 2 records

    Name  Age      City
0   John   25  New York
1  Alice   30    London

In [11]:
df.tail(2)  # gives last 2 records

    Name  Age    City
1  Alice   30  London
2    Bob   35   Paris

In [12]:
df.info()  # provides all info about dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [49]:
df1.describe()  
#the describe() method returns description of the data in the DataFrame, for numerical columns only

          land_area  fertility_rate  median_age
count  2.340000e+02      233.000000  233.000000
mean   5.559568e+05        2.414163   31.309013
std    1.691024e+06        1.155913    9.628386
min    0.000000e+00        0.800000   15.000000
25%    2.650000e+03        1.600000   22.000000
50%    7.972000e+04        2.000000   32.000000
75%    4.070800e+05        3.000000   40.000000
max    1.637687e+07        6.700000   54.000000

# Removing unwanted columns using drop()

In [52]:
data=pd.read_csv('data.csv')
data

   Unnamed: 0   Name  Age      City
0           0   John   25  New York
1           1  Alice   30    London
2           2    Bob   35     Paris

In [53]:
data.columns      # to know columns name

Index(['Unnamed: 0', 'Name', 'Age', 'City'], dtype='object')

In [54]:
data.index        # to know index name

RangeIndex(start=0, stop=3, step=1)

In [55]:
data.columns=list('ABCD')
data.index=list('ABC')

In [56]:
data.drop(['A'])                    # delete data based on rows name i.e A is assume as row

   A      B   C       D
B  1  Alice  30  London
C  2    Bob  35   Paris

In [57]:
data.drop(['A'],axis=0)              # same as data.drop(['A'])

   A      B   C       D
B  1  Alice  30  London
C  2    Bob  35   Paris

In [58]:
data.drop(['A','B'],axis=1)       # also give multiple columns name in list        

#Note : for working on columns always pass second parameter axis = 1  otherwise by default axis=0 (for rows)

    C         D
A  25  New York
B  30    London
C  35     Paris

In [20]:
data    # after deletion original data is not changed until we assign the updation to it

   A      B   C         D
A  0   John  25  New York
B  1  Alice  30    London
C  2    Bob  35     Paris

# Use of inplace

To save changes to original data pass inplace = True

In [21]:
data.drop(['A','B'],axis=1,inplace=True)
data                                       # using inplace=True original data is updated then convert it into csv format again

    C         D
A  25  New York
B  30    London
C  35     Paris

# Sorting data based on index

In [61]:
data.sort_index(ascending=False)       # sort along row

          D   C      B  A
C     Paris  35    Bob  2
B    London  30  Alice  1
A  New York  25   John  0

In [63]:
data.sort_index(ascending=False,axis=1,inplace=True)    # sort along columns  in descending order    
data

          D   C      B  A
A  New York  25   John  0
B    London  30  Alice  1
C     Paris  35    Bob  2

In [64]:
data.sort_index(ascending=True,axis=1,inplace=True)    # sort along columns in ascending order     
data

   A      B   C         D
A  0   John  25  New York
B  1  Alice  30    London
C  2    Bob  35     Paris

# Sorting based on column values

In [66]:
data

   A      B   C         D
A  0   John  25  New York
B  1  Alice  30    London
C  2    Bob  35     Paris

In [69]:
data.sort_values(by='D')     # SORT BASED ON VALUES OF COLUMN D   

# For Sorting based on multiple column values just pass by = ['column1','column2','column3',...]

   A      B   C         D
B  1  Alice  30    London
A  0   John  25  New York
C  2    Bob  35     Paris

In [72]:
data.sort_values(by=['B','D'])     # SORT BASED ON MULTIPLE COLUMN VALUES

   A      B   C         D
B  1  Alice  30    London
C  2    Bob  35     Paris
A  0   John  25  New York

# USE OF LOC() & ILOC()

In [25]:
data=pd.read_csv('data.csv')
data.columns=list('ABCD')
data.index=list('ABC')
data

   A      B   C         D
A  0   John  25  New York
B  1  Alice  30    London
C  2    Bob  35     Paris

In [26]:
data.loc['A']         # ACCESS DATA BASED ON ROW NAME (ALWAYS PASS SAME NAME AS ROW NAME)

A           0
B        John
C          25
D    New York
Name: A, dtype: object

In [27]:
data.loc[['A'],:]       # loc[first parameter row name , second is column name ] 

#Note - here : means all columns

   A     B   C         D
A  0  John  25  New York

In [28]:
data.loc[:,['C','D']]    # ALL ROWS BUT COLUMN = C & D

    C         D
A  25  New York
B  30    London
C  35     Paris

In [29]:
data.iloc[0]       # here we pass index no or column no

A           0
B        John
C          25
D    New York
Name: A, dtype: object

In [30]:
data.iloc[[0,2],:]   # access row 0 & row 2 data

   A     B   C         D
A  0  John  25  New York
C  2   Bob  35     Paris

In [31]:
data.iloc[:,[0,2]]  # access column 0 &column 2 data

   A   C
A  0  25
B  1  30
C  2  35

# In pandas, a missing value (NA: not available) is mainly represented by nan (not a number). None is also considered a missing value.

In [32]:
import pandas as pd

data = {'Name': ['John', None, 'Bob'],
       'Age': [25, 30, None],
       'City': [None, 'London', None]}

df = pd.DataFrame(data)

print(df)
df.to_csv('newdata.csv')                    # Here None is used to make empty cells

   Name   Age    City
0  John  25.0    None
1  None  30.0  London
2   Bob   NaN    None

In [33]:
data=pd.read_csv('newdata.csv')         # here NaN represent empty cells in csv file 
data

   Unnamed: 0  Name   Age    City
0           0  John  25.0     NaN
1           1   NaN  30.0  London
2           2   Bob   NaN     NaN

# Use of isnull() and notnull()

In [34]:
data.isnull()         # give true for missing data else false

   Unnamed: 0   Name    Age   City
0       False  False  False   True
1       False   True  False  False
2       False  False   True   True

In [35]:
data.notnull()       # give false for missing data and true for cell having data

   Unnamed: 0   Name    Age   City
0        True   True   True  False
1        True  False   True   True
2        True   True  False  False

In [36]:
data.loc[:,'Name'].isnull()     # check which row contain missing data

0    False
1     True
2    False
Name: Name, dtype: bool

# Use of Fillna()

In [37]:
data.loc[:,'City'].fillna('XXX')

0       XXX
1    London
2       XXX
Name: City, dtype: object

In [38]:
data

   Unnamed: 0  Name   Age    City
0           0  John  25.0     NaN
1           1   NaN  30.0  London
2           2   Bob   NaN     NaN

In [39]:
data.loc[:,'City'].fillna('Missing City',inplace=True)      
data

   Unnamed: 0  Name   Age          City
0           0  John  25.0  Missing City
1           1   NaN  30.0        London
2           2   Bob   NaN  Missing City

# Remove Duplicates

In [40]:
import pandas as pd

data = {'Name': ['John', 'John','John' ,'Bob'],
       'Age': [25, 30,30, None],
       'City': [None, 'London','London', None]}

df = pd.DataFrame(data)

print(df)
df.to_csv('newdata.csv')

   Name   Age    City
0  John  25.0    None
1  John  30.0  London
2  John  30.0  London
3   Bob   NaN    None

In [41]:
df.drop_duplicates()      # remove all duplictes rows except first duplicate row   (by default keep= First)

   Name   Age    City
0  John  25.0    None
1  John  30.0  London
3   Bob   NaN    None

In [42]:
df.drop_duplicates(keep='last')  # delete all duplicates but keep last duplicated row

   Name   Age    City
0  John  25.0    None
2  John  30.0  London
3   Bob   NaN    None

In [43]:
df.drop_duplicates(keep=False)  # delete all duplicate records

   Name   Age  City
0  John  25.0  None
3   Bob   NaN  None

In [44]:
df

   Name   Age    City
0  John  25.0    None
1  John  30.0  London
2  John  30.0  London
3   Bob   NaN    None

In above cases drop only those records which are having all column data same like record 1 & record 2 are same

In [45]:
df.drop_duplicates(subset='City')   
# delete those records where city column data are duplicates 
#i.e city's record 0 = city's record 3 & city's record 1= city's record2
# Note pass inplace=True to update in original data

   Name   Age    City
0  John  25.0    None
1  John  30.0  London

# use of dropna()

In [46]:
df

   Name   Age    City
0  John  25.0    None
1  John  30.0  London
2  John  30.0  London
3   Bob   NaN    None

In [47]:
df.dropna()   # drop those record which comtain empty cell either having 1

   Name   Age    City
1  John  30.0  London
2  John  30.0  London

In [48]:
df.dropna(how='all')  # dlt those record where whole record is empty

   Name   Age    City
0  John  25.0    None
1  John  30.0  London
2  John  30.0  London
3   Bob   NaN    None